{
 "whatIsEggyCar": {
  "title": "What is Eggy Car?",
  "p1": "Beedo Games launched Eggy Car in July 2022, a driving game packed with physics fun. Imagine a car with a wobbly egg as your VIP passenger, fragile as a glass ornament. The mission? Keep that egg safe on roads bumpier than a dirt trail after rain. A fall or crack means game over, bro.",
  "p2": "Hills and obstacles are like hurdles in a race, testing your skills. Speed and brakes need careful handling, like balancing a spoon of soup. Coins and power-ups pop up along the path. Coins unlock shiny new cars, like picking a new toy from the store. Power-ups ease the ride or stretch your distance, making it feel like a cheat code for a smoother journey. It’s a wild ride that keeps you on your toes!"
 },
 "howToPlay": {
  "title": "How to Play Eggy Car Online",
  "p1": "The game drops you at a hill’s base, your tiny car cradling a shaky egg. That egg’s wobbling like a loose marble, ready to tumble any second. Slamming the gas is like kicking a sandcastle disaster. Instead, tap the gas gently, inching forward to keep the egg steady as a sleeping baby.",
  "span1": "Hit the hilltop, and the real thrill kicks in: the downhill plunge. Brake lightly to avoid rocking the car like a seesaw at the park.",
  "p2": "Too much brake, and the egg slides forward like a kid on a water slide. Too little, and it bounces like a ping-pong ball in a windstorm. Smooth driving, with eyes locked on the road, keeps the egg safe. The challenge hits hard from the jump. Roads get wilder, think steep hills like mountain peaks and bumps like speed humps on steroids. A careless move sends the egg crashing faster than a dropped phone. Speed up on climbs, ease off at peaks, brake softly downhill. That’s the secret sauce for a long, safe ride that’ll make you feel like a pro."
 },
 "earnRewards": {
  "title": "Earn Rewards",
  "p1": "Coins gleam on the road, sparkling like treasure in a pirate’s chest. But hold up, some are sneaky traps!",
  "p2": "These gold coins, your rewards, sit in risky spots to lure you into danger, like bait in a mousetrap. Chasing one down a steep hill is like diving for a coin in a stormy sea; your egg might not make it. Grab coins only when the road’s chill, or you’ll end up with a broken egg and a sad face."
 }
}
