{
 "intro": {
  "title": "Eggy Car Play Unblocked For Free (Offical)",
  "content": [
   {
    "type": "paragraph",
    "text": "Picture yourself driving a quirky car with an egg so delicate it’s like a soap bubble ready to pop. Eggy Car’s a simple game with a sneaky challenge: roll as far as possible without scrambling that egg. Eggy Car Unblocked keeps things easy to control. Gas and brakes need spot-on timing, like threading a needle. Hills and bumps make the road a rollercoaster of chaos. A single slip sends the egg crashing like a dropped plate. Drive slow, keep steady, and brace for a crazy, fun adventure that’ll have you hooked!"
   }
  ]
 },
 "whatIsEggyCar": {
  "title": "What is Eggy Car?",
  "content": [
   {
    "type": "paragraph",
    "text": "Beedo Games launched Eggy Car in July 2022, a driving game packed with physics fun. Imagine a car with a wobbly egg as your VIP passenger, fragile as a glass ornament. The mission? Keep that egg safe on roads bumpier than a dirt trail after rain. A fall or crack means game over, bro."
   },
   {
    "type": "paragraph",
    "text": "Hills and obstacles are like hurdles in a race, testing your skills. Speed and brakes need careful handling, like balancing a spoon of soup. Coins and power-ups pop up along the path. Coins unlock shiny new cars, like picking a new toy from the store. Power-ups ease the ride or stretch your distance, making it feel like a cheat code for a smoother journey. It’s a wild ride that keeps you on your toes!"
   }
  ]
 },
 "howToPlay": {
  "title": "How to Play Eggy Car Online",
  "content": [
   {
    "type": "paragraph",
    "text": "The game drops you at a hill’s base, your tiny car cradling a shaky egg. That egg’s wobbling like a loose marble, ready to tumble any second. Slamming the gas is like kicking a sandcastle disaster. Instead, tap the gas gently, inching forward to keep the egg steady as a sleeping baby."
   },
   {
    "type": "new-line",
    "text": "Hit the hilltop, and the real thrill kicks in: the downhill plunge. Brake lightly to avoid rocking the car like a seesaw at the park."
   },
   {
    "type": "paragraph",
    "text": "Too much brake, and the egg slides forward like a kid on a water slide. Too little, and it bounces like a ping-pong ball in a windstorm. Smooth driving, with eyes locked on the road, keeps the egg safe. The challenge hits hard from the jump. Roads get wilder, think steep hills like mountain peaks and bumps like speed humps on steroids. A careless move sends the egg crashing faster than a dropped phone. Speed up on climbs, ease off at peaks, brake softly downhill. That’s the secret sauce for a long, safe ride that’ll make you feel like a pro."
   },
   {
    "type": "image",
    "src": "/homepage/how-to-play.webp"
   }
  ]
 },
 "earnRewards": {
  "title": "Earn Rewards",
  "content": [
   {
    "type": "paragraph",
    "text": "Coins gleam on the road, sparkling like treasure in a pirate’s chest. But hold up, some are sneaky traps!"
   },
   {
    "type": "paragraph",
    "text": "These gold coins, your rewards, sit in risky spots to lure you into danger, like bait in a mousetrap. Chasing one down a steep hill is like diving for a coin in a stormy sea; your egg might not make it. Grab coins only when the road’s chill, or you’ll end up with a broken egg and a sad face."
   }
  ]
 },
 "upgrades": {
  "title": "Upgrades",
  "content": [
   {
    "type": "paragraph",
    "text": "Power-ups are your best friends. Freeze power-ups lock the egg in place, like supergluing it to the car. Use them on steep hills to zoom like a racecar driver without stressing about the egg."
   },
   {
    "type": "paragraph",
    "text": "Magnets are pure magic, sucking coins to you like a vacuum cleaner gobbling dust. No need to swerve and risk the egg falling."
   },
   {
    "type": "paragraph",
    "text": "New cars unlock with enough coins. Each ride’s got its own vibe, some zip like sports cars, others lumber like tanks. Fast, light cars wobble like a tightrope walker in a breeze. Heavy cars stay steady like a brick house in a storm. New players should stick with slower, wider cars; they’re forgiving, like training wheels. Pros can handle speedy ones for a thrill. Pick what feels like your style, and you’re set."
   }
  ]
 },
 "gamescapeStyle": {
  "title": "Gamescape Style",
  "content": [
   {
    "type": "paragraph",
    "text": "Eggy Car’s visuals burst like a cartoon festival on a sunny day. Bright colors splash the background like a painter’s wildest canvas. Animations glide smoothly, full of spunk. The egg wobbles like it’s grooving to a beat, sometimes flashing a goofy grin that’ll make you chuckle like a kid."
   },
   {
    "type": "paragraph",
    "text": "Cars zip around some tiny and cute, others sleek like sports cars, tearing up the track. Every ride’s got a playful spark, like toys come to life. Cheerful music loops like your favorite song stuck in your head. Coins jingle like bells at a fair when you grab them. Every sound and motion feels like a party you don’t wanna leave."
   }
  ]
 },
 "gameLevels": {
  "title": "Game Levels",
  "content": [
   {
    "type": "paragraph",
    "text": "Eggy Car keeps it simple with one endless mode, like a road trip with no end. No levels, no checkpoints, no timers ticking. Each run starts fresh with a new egg, like a blank page in a sketchbook. Success means topping your last distance and unlocking cars with coins. Practice is your co-pilot, it’s how you go further and further!"
   },
   {
    "type": "paragraph",
    "text": "Cars zip around some tiny and cute, others sleek like sports cars, tearing up the track. Every ride’s got a playful spark, like toys come to life. Cheerful music loops like your favorite song stuck in your head. Coins jingle like bells at a fair when you grab them. Every sound and motion feels like a party you don’t wanna leave."
   },
   {
    "type": "image",
    "src": "/homepage/game-levels.webp"
   }
  ]
 },
 "safeForChildren": {
  "title": "Is Eggy Car safe for children?",
  "content": [
   {
    "type": "paragraph",
    "text": "Parents often stress about kids’ online games, like worrying about a scraped knee. Eggy Car’s a safe bet, with no creepy or bad stuff. Nothing harmful sneaks in. Still, moms and dads should peek in to keep the fun safe, like checking the weather before a picnic."
   },
   {
    "type": "new-line",
    "text": "It’s simple, with no tricky plots to confuse anyone. Kids of all ages can jump in, like splashing in a kiddie pool. No violence, no stranger chats, less chance of anything sketchy, like a clean playground."
   }
  ]
 }
}
