{
 "whatIsEggyCar": {
  "title": "¿Qué es Eggy Car?",
  "p1": "Beedo Games lanzó Eggy Car en julio de 2022, un juego de conducción lleno de diversión y física. Imagina un coche con un huevo tambaleante como pasajero VIP, tan frágil como un adorno de cristal. ¿La misión? Mantener ese huevo a salvo en carreteras más irregulares que un camino de tierra después de la lluvia. Si el huevo cae o se rompe, se acabó el juego, bro.",
  "p2": "Las colinas y los obstáculos son como vallas en una carrera, poniendo a prueba tus reflejos. La velocidad y los frenos deben manejarse con cuidado, como equilibrar una cuchara llena de sopa. Monedas y potenciadores aparecen en el camino. Las monedas desbloquean nuevos coches brillantes, como elegir un juguete nuevo en la tienda. Los potenciadores facilitan el recorrido o te permiten avanzar más, como si tuvieras un truco secreto para un viaje más suave. ¡Es una locura que te mantiene alerta todo el tiempo!"
 },
 "howToPlay": {
  "title": "Cómo jugar Eggy Car en línea",
  "p1": "El juego te deja al pie de una colina, con tu pequeño coche cargando un huevo tembloroso. Ese huevo se tambalea como una canica suelta, listo para rodar en cualquier momento. Pisar el acelerador a fondo es como destruir un castillo de arena. Mejor acelera con suavidad, avanzando poco a poco para mantener el huevo tan estable como un bebé dormido.",
  "span1": "Cuando llegues a la cima, empieza la verdadera emoción: la bajada. Frena con cuidado para no balancear el coche como un columpio en el parque.",
  "p2": "Demasiado freno y el huevo se desliza hacia adelante como un niño en un tobogán. Muy poco, y rebota como una pelota de ping-pong en una tormenta. Conduce con suavidad y mantén los ojos en la carretera para mantener el huevo a salvo. El desafío comienza fuerte desde el principio. Las carreteras se vuelven más locas, con colinas empinadas como montañas y baches como topes gigantes. Un movimiento descuidado y el huevo se rompe más rápido que un teléfono cayendo. Acelera en las subidas, suelta en la cima y frena suavemente en las bajadas. Ese es el truco para un viaje largo y seguro que te hará sentir como un profesional."
 },
 "earnRewards": {
  "title": "Gana recompensas",
  "p1": "Las monedas brillan en la carretera, resplandecientes como un tesoro en un cofre pirata. ¡Pero cuidado, algunas son trampas!",
  "p2": "Estas monedas de oro, tus recompensas, se colocan en lugares peligrosos para tentarte, como cebo en una trampa. Ir tras una en una colina empinada es como lanzarte por una moneda en medio de una tormenta: tu huevo puede no sobrevivir. Toma las monedas solo cuando el camino esté tranquilo, o terminarás con un huevo roto y una cara triste."
 }
}
