{
 "whatIsEggyCar": {
  "title": "Qu’est-ce qu’Eggy Car ?",
  "p1": "Beedo Games a lancé Eggy Car en juillet 2022, un jeu de conduite plein de fun et de physique. Imagine une voiture avec un œuf bancal comme passager VIP, aussi fragile qu’une boule de verre. La mission ? Garder cet œuf intact sur des routes plus cahoteuses qu’un chemin de terre après la pluie. Si l’œuf tombe ou se casse, c’est fini, mon pote.",
  "p2": "Les collines et les obstacles sont comme des haies dans une course, testant ton agilité. La vitesse et les freins doivent être gérés avec soin, comme si tu tenais une cuillère pleine de soupe. Des pièces et des bonus apparaissent sur la route. Les pièces débloquent de nouvelles voitures brillantes, comme choisir un nouveau jouet au magasin. Les bonus rendent le trajet plus facile ou prolongent ton parcours, un peu comme un code de triche pour une virée plus douce. C’est une course folle qui te garde en alerte !"
 },
 "howToPlay": {
  "title": "Comment jouer à Eggy Car en ligne",
  "p1": "Le jeu te place au pied d’une colline, ta petite voiture berçant un œuf tremblant. Cet œuf vacille comme une bille instable, prêt à tomber à tout moment. Appuyer à fond sur l’accélérateur, c’est comme piétiner un château de sable. À la place, accélère doucement, avance petit à petit pour garder l’œuf aussi stable qu’un bébé endormi.",
  "span1": "Une fois au sommet, le vrai frisson commence : la descente ! Freine légèrement pour éviter de faire basculer la voiture comme une balançoire au parc.",
  "p2": "Trop de frein, et l’œuf glisse vers l’avant comme un enfant sur un toboggan. Pas assez, et il rebondit comme une balle de ping-pong dans une tempête. Une conduite fluide, les yeux rivés sur la route, garde l’œuf en sécurité. Le défi commence fort dès le départ. Les routes deviennent de plus en plus folles, avec des collines raides comme des montagnes et des bosses comme des dos d’âne dopés aux stéroïdes. Un faux mouvement et ton œuf s’écrase plus vite qu’un téléphone tombé. Accélère dans les montées, relâche en haut, freine doucement dans les descentes. Voilà la recette pour une longue balade sans casse qui te fera te sentir comme un pro."
 },
 "earnRewards": {
  "title": "Gagner des récompenses",
  "p1": "Les pièces brillent sur la route, étincelantes comme un trésor dans un coffre de pirate. Mais attention, certaines sont de vrais pièges !",
  "p2": "Ces pièces d’or, tes récompenses, se trouvent parfois dans des endroits risqués pour te tenter, comme un appât dans une souricière. En attraper une dans une descente raide, c’est comme plonger pour une pièce dans une mer agitée : ton œuf risque de ne pas survivre. Ramasse les pièces seulement quand la route est tranquille, sinon tu finiras avec un œuf cassé et une mine déconfite."
 }
}
